## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_key_vault.equalvote will be created
  + resource "azurerm_key_vault" "equalvote" {
      + access_policy                 = [
          + {
              + key_permissions    = [
                  + "Create",
                  + "Delete",
                  + "Get",
                  + "Purge",
                  + "Recover",
                  + "Update",
                  + "GetRotationPolicy",
                  + "SetRotationPolicy",
                ]
              + object_id          = "e4536f07-8f5a-4501-be90-6a3d2a09b0f3"
              + secret_permissions = [
                  + "Set",
                ]
              + tenant_id          = "fb5b09d0-6c7c-4bf2-adf7-6fb61f902de9"
            },
        ]
      + id                            = (known after apply)
      + location                      = "westus2"
      + name                          = "equalvote"
      + public_network_access_enabled = true
      + resource_group_name           = "equalvote"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tenant_id                     = "fb5b09d0-6c7c-4bf2-adf7-6fb61f902de9"
      + vault_uri                     = (known after apply)
    }

  # azurerm_key_vault_key.sops will be created
  + resource "azurerm_key_vault_key" "sops" {
      + curve                   = (known after apply)
      + e                       = (known after apply)
      + id                      = (known after apply)
      + key_opts                = [
          + "decrypt",
          + "encrypt",
        ]
      + key_type                = "EC"
      + key_vault_id            = (known after apply)
      + n                       = (known after apply)
      + name                    = "sops"
      + public_key_openssh      = (known after apply)
      + public_key_pem          = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
      + x                       = (known after apply)
      + y                       = (known after apply)

      + rotation_policy {
          + expire_after         = "P90D"
          + notify_before_expiry = "P29D"

          + automatic {
              + time_before_expiry = "P30D"
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>